Repository: jpawlowski/openvpn-als
Catalog: language/src/ZH-CN/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Active Directory
zh_cn: 当前路径

source: Message resources for the OpenVPN-ALS Active Directory feature
zh_cn: OpenVPN-ALS当前路径特点的信息资源

source: Connection
zh_cn: 连接

source: Active Directory Connection
zh_cn: 当前路径连接

source: OU Filter
zh_cn: OU 滤镜

source: Active Directory OU Filter
zh_cn: OU 滤镜的当前路径

source: Options
zh_cn: 选项

source: Active Directory Options
zh_cn: 当前路径选项

source: OpenVPN-ALS will integrate with your network's Active Directory server allowing users to use the same logon credentials as they would use for other Windows resources.
zh_cn: OpenVPN-ALS 将会整合你网络的当前路径下的服务器，允许用户使用和Windows一样的登录密码

source: Roles will map to your Active Directory groups.
zh_cn: 角色讲对应当前用户组

source: Domain Controller Hostname
zh_cn: 管理员用户组名字

source: Host name of Active Directory controller
zh_cn: 当前管理员用户名

source: Backup Domain Controller Hostnames
zh_cn: 备份的管理员用户组名字

source: Host names of backup Active Directory controllers.
zh_cn: 备份的当前目录的管理员用户名

source: Note: Host names may also include a port to overide the default controller port setting e.g. HostName[:Port]
zh_cn: 备注: 用户名可能包含端口覆盖缺省的管理员端口设置，例如：用户名［：端口］

source: Hostname
zh_cn: 用户名

source: Hostnames
zh_cn: 用户名组

source: Add
zh_cn: 添加

source: Remove
zh_cn: 删除

source: Domain
zh_cn: 域

source: Your fully qualified Active Directory domain name.
zh_cn: 你成功的定义了当前目录的域名

source: Service Account Name
zh_cn: 服务账户名字

source: OpenVPN-ALS requires a dedicated Active Directory account to retreive user and group details.
zh_cn: OpenVPN-ALS要求一个有效的当前目录账户去审核用户和用户组的详细信息

source: If using the GSS-API authentication this should be set to the username of the service account e.g "openvpnals".
zh_cn: 如果使用GSS-API 授权，这需要设定服务的用户名账户，例如："openvpnals".

source: If you are using LDAP Simple authentication you must enter a DN in the form "CN=OpenVPN-ALS,OU=Accounts,DC=COMPANY,DC=NET"
zh_cn: 如果使用LDAP 简单授权，你必须输入一个DN（域名）在 "CN=OpenVPN-ALS,OU=Accounts,DC=COMPANY,DC=NET"的格式下

source: Service Account Password
zh_cn: 服务账户密码

source: OpenVPN-ALS requires a dedicated Active Directoryaccount to retreive user and group details.
zh_cn: OpenVPN-ALS要求一个有效的当前目录账户去审核用户和用户组的详细信息

source: This field should be set to the password for this account.
zh_cn: 这里应该为这个账户设置密码

source: Include Organizational Unit Filter
zh_cn: 包含组织滤镜

source: Only include the following OUs when listing accounts and roles from the Active Directory (will still list standard users and groups unless options below are unset).
zh_cn: 仅仅包括下面的OUs，当列出当前目录的账户和角色（将仍然列出标准用户和用户组除非选择不罗列

source: Filter
zh_cn: 滤镜

source: Filters
zh_cn: 滤镜组

source: Exclude Organizational Unit Filter
zh_cn: 排除组织滤镜

source: Exclude the following OUs when listing accounts and roles from the Active Directory.
zh_cn: 排除一下的OUs当罗列当前目录的账户组和角色组时

source: Include built-in groups.
zh_cn: 包括创建用户组

source: Include the built-in group base 'CN=Builtin ....' built from the domain name.
zh_cn: 包括创建用户组基于'CN=Builtin ....' 从域的名字中创建

source: If you do not include these you will have to manually add your own group base string to the the 'Additional group bases' list.
zh_cn: 如果你不包含这些，你将需要手动的添加你自己的组基于字母串到‘额外的基础组’列表

source: See the documentation for more details.
zh_cn: 详情请察看文档

source: Include distribution groups.
zh_cn: 包含分发组

source: Include distribution groups or should only security groups be displayed.
zh_cn: 包含分发组或者仅仅显示安全组

source: Include standard users and groups.
zh_cn: 包含标准的用户群和组群

source: Include the standard user base 'CN=Users ....' built from the domain name.
zh_cn: 包含标准用户基于 'CN=Users ....' 从域名中创建

source: If you do not include these you will have to manually add your own user base string to the the 'Additional user bases' list.
zh_cn: 如果你不包含这些，你将需要手动的添加你自己的组基于字母串到‘额外的用户基础组’列表

source: Service Authentication Type
zh_cn: 授权服务的形式

source: Authentication Type used for service account authentication.
zh_cn: 授权形式用于服务账户的授权

source: If end-users have non-ascii usernames, Simple authentication must be used.
zh_cn: 如果终端用户用不是ASC2码的用户名。简单授权将使用

source: Simple
zh_cn: 简单

source: User Authentication Type
zh_cn: 用户授权形式

source: Authentication Type used for user authentication.
zh_cn: 授权形式用于用户的授权

source: Authentication Timeout
zh_cn: 授权超时

source: Number of seconds before an authentication request to the Active Directory is considered timed out.
zh_cn: 多少秒在一个授权请求到当前目录被认为是超时

source: Authentication Maximum Retries
zh_cn: 验证最大重试

source: Maximum number of retries to apply to each Domain Controller
zh_cn: 验证最大重试将应用于每个域的控制器

source: Connection Timeout
zh_cn: 连接超时

source: Number of seconds before a connection to the Active Directory is considered timed out.
zh_cn: Number of seconds before a connection to the Active Directory is considered timed out.多少秒在连接到当先目录之前被视为超时

source: Cache Objects In Memory
zh_cn: 在内存中的缓存对象

source: Should in-memory caching be used or file based.
zh_cn: 应该使用缓存或者文件依据。

source: For larger user populations, a file based cache is recommended.
zh_cn: 对于较大的用户群，建议使用文件依据缓存

source: Max User Cache Objects
zh_cn: 最大用户缓存对象

source: The maximum number of users stored in the cache.
zh_cn: 最大存储在缓存中的用户数量。

source: Max Group Cache Objects
zh_cn: 最大组缓存对象

source: The maximum number of groups stored in the cache.
zh_cn: 最大存储在缓存中的组的数量。

source: User/Group Cache TTL
zh_cn: 用户/组缓存的TTL

source: The amount of time (in minutes) that user and group information will be cached for.
zh_cn: 用户和组将信息缓存的所需的时间（分钟）

source: Any changes to your active directory (new users, groups etc) will not appear in OpenVPN-ALS until this time has elapsed.
zh_cn: 任何更改，在你的当前目录中（新用户，组等）将不会出现在OpenVPN-ALS直到这个时候已经过去了

source: Page Size
zh_cn: 页面的大小

source: Number of results to return in a single query to the Active Directory (multiple requests are made to receive all required objects).
zh_cn: 返回在当前目录单一查询的结果数量（为了得到所有需要的对象，多个请求将会执行

source: A setting of 0 turns off paging.
zh_cn: 设置0将会关闭页面

source: Member Of Supported
zh_cn: 会员支持

source: If the memberOf attribute supported on the user account, the groups are inspected to find the user's group associations.
zh_cn: 如果成员属性受用户帐户的支持，检查组找到用户的组协会

source: Note: Microsoft Small Business Server requires this to be unticked.
zh_cn: 注意： Microsoft Small Business Server需要，这是unticked 。

source: Enforce username case sensitivity.
zh_cn: 使用户名区分大小写.

source: Windows normally allows logon when the case of a username is incorrect.
zh_cn: 在登录窗口，通常大小写不区分

source: Enable this option to force users to enter the correct case for their usernames
zh_cn: 启用此选项，迫使用户在输入正确用户名区分大小写

source: Follow Referrals
zh_cn: 后续推介

source: Child domains require this value to be selected.
zh_cn: 子域要求选择这个值

source: The Active Directory user cache is full.
zh_cn: 当前目录缓存是满的

source: There may be more accounts on the Active Directory which are not currently visible from OpenVPN-ALS.
zh_cn: 在当前目录下，可能有更多的账户，OpenVPN-ALS是看不到的

source: It is recommended that the cache size is increased from it's current value: {0}.
zh_cn: 推荐增加缓存的数量，在现在值的基础上: {0}.

source: The Active Directory group cache is full.
zh_cn: 当前目录组缓存是满的

source: There may be more groups on the Active Directory which are not currently visible from OpenVPN-ALS.
zh_cn: 在当前目录下，可能有更多的组，OpenVPN-ALS是看不到的

source: Agent (Server resources)
zh_cn: 代理 (服务器资源)

source: Message resources for the Agent server components.
zh_cn: 信息资源的代理服务器组件

source: Invalid VPN session.
zh_cn: 无效的VPN会话.

source: A pending VPN session ticket is required.
zh_cn: 待审批的VPN会话票是被要求的

source: The agent registered successfully.
zh_cn: 代理注册成功

source: The agent failed to register within the allowed time period.
zh_cn: 代理注册失败在允许的时间下

source: Agent shutdown failed because the agent was not active.
zh_cn: 代理关闭失败因为代理是不活动

source: Agent (Client)
zh_cn: 代理(客户)

source: Message resources for the OpenVPN-ALS Agent Client components.
zh_cn: OpenVPN-ALS代理客户端组件的信息资源

source: OpenVPN-ALS Agent
zh_cn: OpenVPN-ALS 代理

source: Launching {0}
zh_cn: 正在打开 {0}

source: {0} launcher.
zh_cn: {0} 正在打开.

source: Processing {0} descriptor.
zh_cn: 处理{0} 描述.

source: Launching.
zh_cn: 正在打开

source: Downloading.
zh_cn: 下载中.

source: Download Complete.
zh_cn: 下载完成.

source: Closing application tunnel to {0}.
zh_cn: 正在关闭应用隧道 {0}.

source: An error occurred launching {0}: {1}
zh_cn: 错误出现在打开过程中{0}: {1}

source: Error Launching Application
zh_cn: 打开应用程序错误

source: TxRx Monitor
zh_cn: TxRx 监控

source: The Tx/Rx thread was interrupted
zh_cn: Tx/Rx 线程被打断

source: The TXRX thread failed
zh_cn: The TXRX 线程失败

source: OpenVPN-ALS Agent is now running
zh_cn: OpenVPN-ALS代理现在运行

source: Error
zh_cn: 错误

source: Close
zh_cn: 关闭

source: The OpenVPN-ALS Agent failed connect.
zh_cn: OpenVPN-ALS代理连接失败

source: Agent has {0} tunnel(s) open but no active connections.
zh_cn: Agent有 {0} 隧道打开没有激活连接

source: Agent has {0} tunnel(s) open with {1} active connection(s).
zh_cn: Agent 有 {0} 隧道打开包含{1} 激活连接

source: There are no open tunnels but {0} active connections remain.
zh_cn: 目前没有开放的隧道但{0} 激活的连接存在

source: The OpenVPN-ALS Agent is Idle
zh_cn: The OpenVPN-ALS代理是空闲的

source: Channel opened.
zh_cn: 频道开放了.

source: Registration failed.
zh_cn: 注册失败.

source: Error code {0}.
zh_cn: 错误码{0}.

source: Too many redirects.
zh_cn: 过多的重定向

source: Agent is shutting down
zh_cn: 代理正在关闭

source: Setting user specified local proxy URL to {0}.
zh_cn: 设置用户指定的本地代理网址到 {0}.

source: OpenVPN-ALS Agent debug mode is not enabled, only serious errors will be displayed.
zh_cn: OpenVPN-ALS代理调试模式没有启用，只有严重的错误才会显示出来

source: Expected hostname, port, username and ticket command line arguments
zh_cn: 期望的主机名，端口，用户名和票的命令行参数

source: The server did not respond within the keep-alive time period.
zh_cn: 该服务器没有响应在保活时间期限内

source: The server responded with an error.
zh_cn: 服务器错误响。

source: OpenVPN-ALS Message
zh_cn: OpenVPN-ALS消息

source: Received: {0}
zh_cn: 接受: {0}

source: Looking up registry value: scope={0} key={1} value={2}
zh_cn: 查找注册值: 范围={0} 钥匙={1} 值={2}

source: Agent (AWT Client)
zh_cn: 代理 (AWT客户端)

source: Message resources for the AWT version of the OpenVPN-ALS Agent Client components.
zh_cn: OpenVPN-ALS代理客户端组件的AWT版本信息资源

source: Local
zh_cn: 本地

source: Type
zh_cn: 形式

source: Name
zh_cn: 名字

source: Remote
zh_cn: 远端

source: Active
zh_cn: 当前

source: Stop
zh_cn: 停止

source: Total
zh_cn: 总计

source: Open Browser
zh_cn: 打开浏览器

source: Debug Console
zh_cn: 纠错控制台

source: Tunnel Monitor
zh_cn: 隧道监视器

source: Exit
zh_cn: 退出

source: File
zh_cn: 文件

source: Realm:
zh_cn: 领域:

source: Domain:
zh_cn: 域:

source: Username:
zh_cn: 用户名：

source: Password:
zh_cn: 密码:

source: Proxy Server Authentication
zh_cn: 代理服务器授权

source: Ok
zh_cn: 确定

source: Cancel
zh_cn: 取消

source: Clear
zh_cn: 清空

source: OpenVPN-ALS Console
zh_cn: OpenVPN-ALS控制台

source: Failed to launch.
zh_cn: 打开失败。

source: Exception during process monitoring.
zh_cn: 在监视过程中出现异常.

source: Opening browser to {0}.
zh_cn: 打开浏览器到 {0}.

source: OpenVPN-ALS server is not available
zh_cn: OpenVPN-ALS服务器不可用

source: The heartbeat thread failed
zh_cn: The heartbeat 线程失败

source: Heartbeat thread exited, starting shutdown procedure.
zh_cn: Heartbeat 线程已退出, 开始关闭步骤

source: Sending client heartbeat
zh_cn: 传送客户端heartbeat

source: Received response from server
zh_cn: 从服务器收到的回应

source: Server is alive
zh_cn: 服务器正在运行

source: Unrecognised element {0} in heartbeat response.
zh_cn: 无法识别元素 {0} 在heartbeat回应中.

source: Received shutdown instruction during heartbeat
zh_cn: 接受关闭指示在heartbeat过程中

source: Server responded with error
zh_cn: Server错误响应

source: Heartbeat failed.
zh_cn: Heartbeat 线程失败

source: Adding request listener
zh_cn: 增加请求监听

source: Waiting for a client connection on port {0}
zh_cn: 等待用户连接到端口 {0}

source: Got connection from {0}
zh_cn: 有连接从 {0}

source: Failed to accept a client connection
zh_cn: 允许客户端连接失败

source: Request failed
zh_cn: 请求失败

source: HTTP Server
zh_cn: HTTP服务器

source: Processing request {0}
zh_cn: 处理请求{0}

source: HTTP version {0}
zh_cn: HTTP 版本 {0}

source: Unsupported request {0}
zh_cn: 不支持的请求{0}

source: HTTP Header: {0}
zh_cn: HTTP 头标题: {0}

source: Request contains some content of type {0}
zh_cn: 请求包含某些类型的内容 {0}

source: Reading {0} bytes of form data
zh_cn: 读 {0} 表格数据的字节

source: Extracting parameters from form data {0}
zh_cn: 从表格数据提取参数{0}

source: HTTP Encoded Parameter: {0} = {1}
zh_cn: HTTP 加密参数: {0} = {1}

source: HTTP Parameter: {0} = {1}
zh_cn: HTTP 参数: {0} = {1}

source: HTTP Encoded Parameter: {0}
zh_cn: HTTP 加密参数: {0}

source: HTTP Parameter: {0}
zh_cn: HTTP 参数: {0}

source: Unhandled request for {0}
zh_cn: 为处理的请求 {0}

source: Redirecting browser to {0}
zh_cn: 重定向浏览器到 {0}

source: Local Port
zh_cn: 当地端口

source: Close tunnels
zh_cn: 关闭隧道

source: Are you sure you wish to stop the selected tunnels?
zh_cn: 你确定你想停止你选择的隧道？

source: Any applications that are using them may cease working correctly and you may lose work.
zh_cn: 任何应用程序在使用这些隧道将正确的停止工作你可能失去你的工作

source: Last data
zh_cn: 最新的数据

source: The HTTP server is redirecting the user agent
zh_cn: HTTP服务器重定向用户代理

source: Getting application descriptor using Maverick HTTP client
zh_cn: 得到应用程序描述使用MaverickHTTP客户端

source: Downloading application file using Maverick HTTP client
zh_cn: 下载应用程序描述使用MaverickHTTP客户端

source: Allow untrusted hosts is set to {0}.
zh_cn: 允许不受信任的主机被设置为 {0}.

source: Failed to retrieve tunnels.
zh_cn: 无法撷取隧道

source: An unexpected error has occured.
zh_cn: 不被期望的错误出现

source: OpenVPN-ALS Agent must now exit
zh_cn: OpenVPN-ALS代理必需现在关闭

source: Critical failure
zh_cn: 决定性的失败

source: Starting {0}
zh_cn: 启动中 {0}

source: Critical error, shutting down.
zh_cn: 决定性的错误，正在关闭.

source: Unable to start extension {0}
zh_cn: 不能启动extension {0}

source: Attempting to detect proxy settings using platform specific methods
zh_cn: 试图检测代理设置使用平台的对应的方法

source: Failed to get IE proxy settings, trying Firefox.
zh_cn: 无法取得IE浏览器的代理设置，试图Firefox的

source: Failed to get Firefox proxy settings.
zh_cn: 无法取得Firefox的代理设置。

source: Found some proxy settings.
zh_cn: 发现了一些代理设置。

source: No useragent supplied, automatic proxy could not check for browse type.
zh_cn: 没有用户代理提供了，自动代理不能检查浏览器类型。

source: Using plugin supplied proxy settings.
zh_cn: 利用插件提供的代理设置

source: Installing Maverick SSL support for HTTPSURLStreamHandler
zh_cn: 安装Maverick的SSL为了支持HTTPSURLStreamHandler

source: Configured logging
zh_cn: 配置记录

source: Looking for Firefox
zh_cn: 寻找Firefox

source: Starting HTTPD
zh_cn: 正在启动HTTPD

source: HTTPD created on port {0}.
zh_cn: HTTPD 在端口上创建 {0}.

source: Failed to start HTTPD.
zh_cn: 启动HTTPD失败.

source: Looking for IE
zh_cn: 寻找IE

source: Invalid tunnel type {0}.
zh_cn: 无效隧道类型 {0}.

source: Only local forwards can start a local listening socket.
zh_cn: 只有本地推送可以启动一个本地侦听socket

source: Opened local tunnel "{0}" on port {1} to {2}.
zh_cn: 打开本地隧道"{0}" 在端口 {1} to {2}.

source: Opened remote tunnel "{0}" on port {1} to {2}.
zh_cn: 打开远程的隧道 "{0}" 在端口 {1} to {2}.

source: Stopping listening socket {0}.
zh_cn: 停止监听socket {0}.

source: Closing local tunnel "{0}" on port {1} to {2}.
zh_cn: 正在关闭本地隧道"{0}" 在端口 {1} to {2}.

source: Closing remote tunnel "{0}" on port {1} to {2}.
zh_cn: 关闭远程隧道"{0}" 在端口 {1} to {2}.

source: Channel closed.
zh_cn: 频道关闭.

source: Registering with the OpenVPN-ALS server
zh_cn: 在OpenVPN-ALS服务器上注册

source: Server is {0}
zh_cn: 服务器是 {0}

source: Got response from server.
zh_cn: 从服务器得到响应.

source: Got ticket: {0}
zh_cn: 得到票: {0}

source: De-registering from the OpenVPN-ALS server
zh_cn: 在OpenVPN-ALS服务器上注销

source: De-registration failed.
zh_cn: 注销失败..

source: Starting agent shutdown procedure.
zh_cn: 开始代理关闭步骤.

source: Stopping extension {0}.
zh_cn: 正在关闭 extension {0}.

source: Exiting JVM.
zh_cn: 正在退出 JVM.

source: Checking if {0} is suitable.
zh_cn: 正在检查是否 {0} 合适.

source: Setting local proxy URL to {0}.
zh_cn: 设置本地代理网址到 {0}.

source: Setting browse to {0}.
zh_cn: 设置浏览器到 {0}.

source: Processing HTTP request {0}.
zh_cn: 处理 HTTP请求 {0}.

source: Application launched.
zh_cn: 应用程序已启动.

source: Failed to launch application.
zh_cn: 应用程序启动失败.

source: OpenVPN-ALS Agent shutdown.
zh_cn: OpenVPN-ALS代理关闭.

source: Requesting tunnel for {0}
zh_cn: 请求隧道为 {0}

source: Failed to register local tunnel with the server.
zh_cn: 向服务器注册本地隧道失败

source: Registered local tunnel with ID of {0}
zh_cn: 已注册的本地隧道，用ID{0}

source: Failed to register remote tunnel with the server.
zh_cn: 向服务器注册远端隧道失败

source: Registered remote tunnel with ID of {0}
zh_cn: 已注册的远端隧道，用ID {0}

source: Invalid tunnel type {0}
zh_cn: 无效隧道类型 {0}

source: Failed to start tunnel.
zh_cn: 启动隧道失败

source: Failed to start tunnel {0}.
zh_cn: 启动隧道失败{0}.

source: Request to open {0} via a temporary tunnel
zh_cn: 打开请求 {0} 通过一个零时的隧道

source: Could not create temporary tunnel.
zh_cn: 无法创建临时隧道。

source: Tunnel closed.
zh_cn: 隧道关闭.

source: Request not found
zh_cn: 没有发现请求

source: You must select at least one tunnel to remove.
zh_cn: 你必需选择删除至少一个隧道

source: Removing tunnels with username of {0}
zh_cn: 删除用户名使用的隧道 {0}

source: Cannot remove global tunnels.
zh_cn: 不能删除全局隧道.

source: Only administrators can remove global tunnels.
zh_cn: 只有管理员才可以删除全局隧道

source: No tunnel with id of {0}, probably a temporary tunnel
zh_cn: 没有用ID的隧道{0}, 可能是零时的隧道

source: Failed to remove tunnels.
zh_cn: 删除隧道失败

source: Failed to remove tunnel.
zh_cn: 删除隧道失败。

source: Adding ticket {0} to request parameters
zh_cn: 添加票 {0} 请求参数

source: Starting application {0}
zh_cn: 正在开始应用程序{0}

source: Launching application "{0}"
zh_cn: 正在打开应用程序"{0}"

source: You must select at least one tunnel to close.
zh_cn: 你必需选择关闭至少一个隧道

source: You must select at least one tunnel to open.
zh_cn: 你必需选择打开至少一个隧道.

source: No forwarding tunnel with id {0}
zh_cn: 没有拥有ID的推送隧道 {0}

source: No forwarding tunnel with id of {0}.
zh_cn: 没有拥有ID的推送隧道 {0}。

source: If this is a new global tunnel, you should restart the OpenVPN-ALS Agent.
zh_cn: 如果这是一个新的全局隧道，你需要重新启动 OpenVPN-ALS代理

source: Failed to start listening socket.
zh_cn: 开始监听socket失败

source: Failed to open tunnel.
zh_cn: 打开隧道失败

source: Starting tunnel inactivity monitor (tunnels {0}ms, web forwards {1}ms)
zh_cn: 正在启动不活动隧道监视器(隧道 {0}ms, web推送{1}ms)

source: Checking for tunnel inactivity
zh_cn: 正在检测不活动隧道

source: Permanent / Temporary Single Connect tunnel {0} is out of date, closing.
zh_cn: 永久/ 暂时连接隧道{0}已过期，正在关闭

source: Temporary Multiple Connection (Webforward) tunnel {0} is out of date, closing.
zh_cn: 永久/ 暂时多通道连接（web推送）隧道{0}已过期，正在关闭

source: Failed to check state of tunnel {0}.
zh_cn: 检测隧道状态失败{0}.

source: Failed to check state of tunnels.
zh_cn: 检测隧道状态失败。

source: Disconnected, so stopping tunnel inactivity monitor.
zh_cn: 断开连接，所以正在关闭不活动隧道监视器。

source: OpenVPN-ALS/Agent
zh_cn: OpenVPN-ALS/代理

source: Unexpected HTTP error: {0}
zh_cn: 不期望的HTTP错误: {0}

source: Unexpected host not found error in HTTP request: {0}
zh_cn: 不期望的主机没发现错误在HTTP请求中： {0}

source: Configuring HTTP proxy to {0}
zh_cn: 设置HTTP代理到{0}

source: Creating HttpClient instance
zh_cn: 创建Http客户端实例

source: Attempting to create a listening socket for {0}:{1} on the random port {2}
zh_cn: 尝试创建一个监听socket为 {0}:{1} 在随机的端口 {2}

source: Creating SSL tunnel to {0}:{1}
zh_cn: 创建 SSL 隧道 to {0}:{1}

source: Configuring proxies for HttpClient instance
zh_cn: 为Http客户端实例设置代理

source: Registering application tunnel {0} ({1}:{2})
zh_cn: 正在注册应用程序隧道 {0} ({1}:{2})

source: Registering listening socket
zh_cn: 正在注册监听socket

source: Registered tunnel {0}:{1}
zh_cn: 已注册隧道 {0}:{1}

source: Random port {0} failed!
zh_cn: 随机端口 {0} 失败!

source: {1} attempts left
zh_cn: {1} 剩余的尝试

source: All attempts to create a listening socket failed
zh_cn: 所有创建监听socket的尝试失败了

source: Registering tunnel
zh_cn: 正在注册隧道

source: The server failed to register the application tunnel named {0}.
zh_cn: 服务器注册应用程序隧道命名失败{0}.

source: Preferred port disabled, choosing a random one.
zh_cn: 偏好的端口禁用了,随机选择一个.

source: Failed to construct url
zh_cn: 创建url失败

source: Failed to connect url
zh_cn: 连接url失败

source: Closing remote listener
zh_cn: 正在关闭远端监听

source: Looking for tunnels to open
zh_cn: 寻找隧道用以开启

source: Unexpected authentication error in HTTP request: {0}
zh_cn: 不期望的授权错误在HTTP请求中： {0}

source: Set OpenVPN-ALS credentials to {0}:{1}
zh_cn: 设置OpenVPN-ALSto全权证书到 {0}:{1}

source: Tunnel {0} from {1} to {2}:{3}
zh_cn: 隧道 {0} 从 {1} 到 {2}:{3}

source: Invalid child element in tunnels element
zh_cn: 无效的子元素在隧道元素中

source: Attempting to create a temporary single connection listening socket for {0}:{1} on the preferred port {2}
zh_cn: 尝试创建一个零时的单连接监听socket 为 {0}:{1}偏好的端口{2}

source: Attempting to create a listening socket for {0}:{1} on the preferred port {2}
zh_cn: 尝试创建一个监听socket为 {0}:{1} 在偏好的端口 {2}

source: Only remote forward can request a remote listening socket
zh_cn: 只有远端推送可以请求一个远端侦听socket

source: Removing local connection listener with ticket {0}
zh_cn: 正在删除本地连接监听和票{0}

source: Did not get a list of tunnels to start, got "{0}" instead.
zh_cn: 没有得到隧道列表用以启动, 得到"{0}" 代替.

source: Preferred port failed as its probably in use by another application
zh_cn: 偏好端口失败因为它可能被另一个应用程序占用

source: HTTP connection failed: {0} [{1}]
zh_cn: HTTP连接失败: {0} [{1}]

source: Attempting to create a listening socket for {0}:{1} on the port {2}
zh_cn: 尝试创建一个监听socket为 {0}:{1} 端口 {2}

source: No local connection listener with ticket {0}
zh_cn: 没有本地连接监听和票 {0}

source: Disconnecting remote forwarding listener with ticket {0}
zh_cn: 断开远端推送监听和票{0}

source: Failed to start listening socket
zh_cn: 开始监听socket失败

source: Unexpected error in fowarding registration!
zh_cn: 无期望的错误在推送注册中!

source: Agent (SWT Client)
zh_cn: 代理 (SWT 客户端)

source: Message resources for the SWT version of the OpenVPN-ALS Agent Client components.
zh_cn: 对于OpenVPN-ALS代理的SWT版本的组件的信息资源

source: Authentication Required
zh_cn: 需要授权

source: {2} authentication required for {0} at {1}.
zh_cn: {2} 需要授权 {0} at {1}.

source: About OpenVPN-ALS Agent
zh_cn: 关于OpenVPN-ALS代理

source: The OpenVPN-ALS Agent is an application that is required to provide tunneling, application launching and other features to the OpenVPN-ALS server.
zh_cn: OpenVPN-ALS代理是一个应用程序。 它需要被提供隧道，启动程序等功能向OpenVPN-ALS服务器

source: Host: {0}
zh_cn: 终端: {0}

source: Port: {0}
zh_cn: 端口: {0}

source: OpenVPN-ALS Agent {0}
zh_cn: OpenVPN-ALS代理 {0}

source: Copyright© 2003-2007 3SP
zh_cn: 版权© 2003-2007 3SP

source: Username: {0}
zh_cn: 用户名: {0}

source: Server Version: {0}
zh_cn: 服务器版本: {0}

source: Agent Version: {0}
zh_cn: 代理版本: {0}

source: About
zh_cn: 关于

source: Message resources for the OpenVPN-ALS Launcher applet.
zh_cn: OpenVPN-ALS Launcher程序的信息资源

source: Initialising launcher applet
zh_cn: 初始化 launcher applet

source: Getting launcher type information from parameters
zh_cn: 正在从参数中取得 launcher类型信息

source: Launch application
zh_cn: Launch应用程序

source: Launching ..
zh_cn: 正在启动 ..

source: Autostart is <true>, launching client
zh_cn: 自动启动是 <true>, 正在启动的客户端

source: Autostart is *NOT* <true>, *NOT* launching client
zh_cn: 自动启动是 <true>, *NOT* 正在启动的客户端

source: Stopping launcher applet.
zh_cn: 正在停止launcher程序.

source: Ticket is null!
zh_cn: 票是空!

source: Retreiving monitor status
zh_cn: 检索监视器的状态

source: Retreiving debug status
zh_cn: 检索纠错的状态

source: Checking browser proxy settings
zh_cn: 正在检测浏览器代理的设置

source: User agent {0}
zh_cn: 用户代理 {0}

source: No proxy set by user configuration, checking java plugin properties..
zh_cn: 用户没有设置代理, 检查的Java插件属性..

source: Starting application launcher
zh_cn: 启动应用程序launcher

source: Setting local proxy URL to {0}
zh_cn: 设置本地代理网址到 {0}.

source: Prepared launcher
zh_cn: 准备好的 launcher

source: Starting synchronization thread
zh_cn: 开始同步线程

source: Monitoring {0} process
zh_cn: 监视{0} 进程

source: {0} exited with value {1}
zh_cn: {0} 带值退出 {1}

source: No process monitor.
zh_cn: 无进程监控器.

source: Launch
zh_cn: 启动

source: OpenVPN-ALS Launcher Applet
zh_cn: OpenVPN-ALS Launcher 程序

source: Downloading files
zh_cn: 正在下载文件

source: Download complete
zh_cn: 下载完毕

source: Processing application descriptor
zh_cn: 正在处理应用程序描述器

source: Launched OpenVPN-ALS Agent
zh_cn: 已启动 OpenVPN-ALS 代理

source: Destroying launcher applet
zh_cn: 正在删除 launcher 程序

source: Redirecting to {0}
zh_cn: 重定向到 {0}
